# 파이참, 파일(폴더)명 변경(이름 바꾸기) 탄축키: shift + f6

### 컬렉션 타입 ###
# : 다양한 데이터를 그룹화하여 관리할 수 있는 자료형

# List: 여러 아이템을 순서대로 저장, 아이템 변경 가능, 중복된 값의 저장이 허용
# Tuple: 여러 아이템을 순서대로 저장, 아이템 변경 불가능, 중복된 값의 저장이 허용
# Set: 여러 아이템을 순서 없이 저장, 아이템 변경 가능, 중복된 값의 저장이 허용 불가
# Dictionary: 키-값 쌍의 아이템을 저장, 아이템 변경 가능, 키(중복X), 값(중복O)

### List 자료형 ###
# : 대괄호[]를 사용하여 생성, 각 요소는 쉼표(,)로 구분

# 1. 리스트 생성
# 리스트명 = [요소1, 요소2, ...]
list1 = [] # 빈 리스트
list2 = [1, 2, 3] # 정수형 리스트
list3 = ['a', 'b', 'c'] # 문자형 리스트
list4 = [1, 'a', 2, 'b'] # 다양한 자료형의 혼합
list5 = [1, 2, [3, 4]] # 리스트 안에 리스트 (중첩 리스트)

# 2. 리스트 인덱싱 & 슬라이싱
# 리스트 인덱싱
list = [1, 2, 3, 4, 5]
print(list[0]) # 출력: 1
print(list[-2]) # 출력: 4

# 리스트 슬라이싱
print(list[1:3]) # 출력: [2, 3]

# 3. 리스트 연산
# 3-1. 리스트 합치기 ( + )
list1 = [1, 2, 3]
list2 = [4, 5, 6]
list3 = list1 + list2
print(list3) # 출력: [1, 2, 3, 4, 5, 6]

# 3-2. 리스트 반복하기 ( * )
print(list1 * 3) # 출력: [1, 2, 3, 1, 2, 3, 1, 2, 3]

# 3-3. 리스트 길이 구하기: len()
print(len(list1)) # 출력: 3

# 4. 리스트 수정, 삭제 및 추가
# 4-1. 리스트 요소 수정
list = [1, 2, 3] # [1, 2, 4]
list[2] = 4
print(list) # 출력: [1, 2, 4]

# 4-2. 리스트 요소 삭제: del(delete의 축약어)
del list[1]
print(list) # 출력: [1, 4]

# 4-3. 리스트 요소 추가: append()
list.append(5) # 제일 마지막 위치에 요소를 추가
print(list) # 출력: [1, 4, 5]

# 파이썬 교재 p.41 추가 리스트 내장 함수 학습


