### 파이썬 파일 입출력 ###

# 파일 입력: 기존의 파일 내용을 읽어 들이는 것
# 파일 출력: 기존 파일에 새로운 내용을 추가하거나 새로운 파일을 생성하는 것

# 1. 파일 열기
# : 실제로 어떤 파일을 열어보는 것 X
# : 입출력 작업을 진행할 파일을 지정하는 것
# : 입력과 출력 모두 파일 열기 작업을 가장 먼저 수행해야만 한다.

# : open()함수를 사용
# 파일 객체 = open(파일명, 모드)

# 1-1. 파일명: 입출력 작업을 수행할 파일

# 1) 파일명만 작성하는 경우: 파이썬 소스 코드 파일(.py)과 동일한 경로에 존재하는 파일
# D:\python-bt0720-lsa-git\python-bt0720-lsa\0802\sample.txt
# open('sample.txt')

# 2) 전체 경로를 지정하는 경우
# 파이썬 경로 구분자는 슬래시(\)
# open('D:\python-bt0720-lsa-git\python-bt0720-lsa\0802\sample.txt')

# 3) 현재 디렉터리를 기준으로 경로를 지정 가능 (./)
# 해당 파일이 같은 디렉터리 폴더 안에 있는 경우
# open('./sample.txt')

# 4) 상위 디렉터리를 기준으로 경로를 지정 가능 (../)
# open('../differenceSample.txt')

# 1-2. 모드 : 파일을 여는 목적
# 입력: r (read, 읽기) - 파일이 없을 경우(오류 발생), 파일이 있는 경우(읽기)
# - 입출력 모드를 생략하는 경우 기본적으로 r 모드로 파일이 열림.

# 출력: w (write, 쓰기) - 파일이 없을 경우(새로 생성), 파일이 있는 경우(새로 생성)
#      a (append, 추가) - 파일이 없을 경우(새로 생성), 파일이 있는 경우(추가)
#      x (exclusive, 배타적 추가) - 파일이 없을 경우(새로 생성), 파일이 있는 경우(오류 발생)

# 1-3. 파일 종류 구분
# 텍스트 파일 OR 바이너리 파일(텍스트 파일을 제외한 모든 파일)
# t (text) - 텍스트 파일
# - 파일 종류를 생략하는 경우 기본적으로 t 모드로 파일이 열림.
# b (binary) - 바이너리 파일

# rt : 텍스트 파일 읽기 모드
# ab : 바이너리 파일 추가 모드

# 2. 파일 닫기
# close()함수를 사용
# 파일객체.close()

file = open("new_file.txt", "wt") # 새 파일 생성
file.close()

# 3. with문
# : 파일을 열고 작업을 마친 후 자동으로 파일을 닫아주는 기능
# : close()함수를 따로 사용하지 않아도 가능

# 파일 객체 = open('파일명', 모드)
# with open('파일명', 모드) as file:
#   파일처리코드

with open('my_file.txt', 'wt') as file:
    print('my_file.txt 파일이 생성되었습니다.')