### 함수 ###
# 하나의 특정한 목적의 작업을 수행하기 위해 독립적으로 구성된 프로그램 코드의 집합
# 특정 값 X를 인수로 전달받으면, 반드시 특정 값 Y를 결과로 반환

### 사용자 함수 ###
# 1. 사용자 함수 용어
# 1-1. 함수 정의: 사용자 함수를 새로 만드는 것
# 1-2. 인수: 사용자 함수에 전달할 입력(input) - argument
# 1-3. 매개변수: 인수를 받아서 저장하는 변수 - parameter
# 1-4. 반환값: 사용자 함수의 출력(output) - return
# 1-5. 함수 호출: 만들어진 사용자 함수를 실제로 사용하는 것

# 2. 함수 정의
# 함수는 def 키워드를 사용하여 정의

# def 함수명(매개변수):
    # 실행할 코드
    # return 반환값

def greet():
    print('Hello, Python')

# 3. 함수 호출
# 함수 호출은 함수명 다음에 ()괄호를 붙여서 호출
greet()

# 3-1. 인수x, 반환값x
# 함수이름()

# 3-2. 인수o, 반환값x
# 함수이름(인수)

# 3-3. 인수x, 반환값o
# 변수 = 함수 이름()

# 3-4. 인수o, 반환값o
# 변수 = 한수이름(인수)

# print(함수이름()): 반환값을 저장하지 않고 바로 출력

# 프로그램 명명 규칙
# 1. CamelCase: 첫 글자는 소문자로 시작, 중간 글자들은 대문자로 시작
# helloMyNameIsLeeSeungAh
# 자바, 자바스크립트

# 2. snake_case: 이어지는 단어를 _(언더바)를 사용하여 구분
# hello_my_name_is_lee_seung_ah
# 파이썬