### 파이썬 데이터 시각화 - 엑셀 파일 시각화 ###

#! 엑셀이 있는 경우: 엑셀(xlsx)파일 만들기

#! 엑셀이 없는 경우: 데이터 하드 코딩
x축 = ["1월", "2월", "3월", "4월", "5월", "6월", "7월", "8월", "9월", "10월", "11월", "12월"]
y축2020 = [38, 50, 25, 35, 47, 33, 112, 72, 23, 32, 46, 82]
y축2021 = [48, 60, 35, 45, 57, 43, 122, 82, 33, 42, 56, 92]
y축2022 = [58, 70, 45, 55, 67, 53, 132, 92, 43, 52, 66, 102]
소비카테고리 = ["식비", "카페", "영화", "취미생활"]
이번달소비금액 = [32, 9, 3, 7]
이번달소비금액합계 = 85
평균2020 = 57
평균2021 = 66
평균2022 = 78

print(x축)
print(y축2020)
print(y축2021)
print(y축2022)
print(소비카테고리)
print(이번달소비금액)
print(이번달소비금액합계)
print(평균2020)
print(평균2021)
print(평균2022)